### Import Dependencies

In [1]:
import pandas as pd
import os
from sqlalchemy import create_engine
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session

from config_cloud import conn_string
#from config_testdb import conn_string

**get all files for loading**

In [2]:
# path
station_path = os.path.join('.', "station_info.csv")
weather_path = os.path.join('.', "historical_weather.csv")
pricing_path = os.path.join('.', "pricing_index.csv")

#bikes
toronto_bikes = os.path.join("Resources/1_toronto_canada", "toronto_bikes.csv")
vancouver_bikes = os.path.join("Resources/2_vancouver_canada", "vancouver_bikes.csv")
boston_bikes = os.path.join("Resources/3_boston_us", "boston_bikes.csv")
nyc_bikes = os.path.join("Resources/4_NewYork_US", "nyc_bikes.csv")

# membertypes
toronto_users = os.path.join("Resources/1_toronto_canada", "toronto_membertypes.csv")
vancouver_users = os.path.join("Resources/2_vancouver_canada", "vancouver_membertypes.csv")
boston_users = os.path.join("Resources/3_boston_us", "boston_membertypes.csv")
nyc_users = os.path.join("Resources/4_NewYork_US", "nyc_membertypes.csv")

# ridership
toronto_ = os.path.join("Resources/1_toronto_canada", "toronto_bikeshare.csv")
vancouver_ = os.path.join("Resources/2_vancouver_canada", "vancouver_bikeshare.csv")
boston_ = os.path.join("Resources/3_boston_us", "boston_bikeshare.csv")
nyc_ = os.path.join("Resources/4_NewYork_US", "nyc_bikeshare.csv")

**read all files into dataframes**

In [3]:
# read files
stns = pd.read_csv(station_path, encoding="utf-8")
weather = pd.read_csv(weather_path, encoding="utf-8")

# bikes
tor_bikes = pd.read_csv(toronto_bikes, encoding="utf-8")
van_bikes = pd.read_csv(vancouver_bikes, encoding="utf-8")
bos_bikes = pd.read_csv(boston_bikes, encoding="utf-8")
nyc_bikes = pd.read_csv(nyc_bikes, encoding="utf-8")

# member_types
tor_users = pd.read_csv(toronto_users, encoding="utf-8")
van_users = pd.read_csv(vancouver_users, encoding="utf-8")
bos_users = pd.read_csv(boston_users, encoding="utf-8")
nyc_users = pd.read_csv(nyc_users, encoding="utf-8")

# pricing index
pricing_index = pd.read_csv(pricing_path, encoding="utf-8")

# ridership
toronto = pd.read_csv(toronto_, encoding="utf-8")
vancouver = pd.read_csv(vancouver_, encoding="utf-8")
boston = pd.read_csv(boston_, encoding="utf-8")
newyork = pd.read_csv(nyc_, encoding="utf-8")

**Locations**

In [4]:
# create locations table
locations = [{"location_id": 1,"city":"Toronto", "country":"Canada" }, 
             {"location_id": 2,"city":"Vancouver", "country":"Canada"},
             {"location_id": 3,"city":"Boston", "country":"USA"},
             {"location_id": 4,"city":"New York", "country":"USA"}
            ]

df = pd.DataFrame(locations)
df.set_index("location_id", inplace=True)
df

                  city country
location_id
1              Toronto  Canada
2            Vancouver  Canada
3               Boston     USA
4             New York     USA

**Stations**

In [5]:
stns.head()

,station_id,station_name,latitude,longitude,location_id
0,7000,Fort York Blvd / Capreol Ct,43.639832,-79.395954,1
1,7001,Lower Jarvis St / The Esplanade,43.647830,-79.370698,1
2,7002,St. George St / Bloor St W,43.667333,-79.399429,1
3,7003,Madison Ave / Bloor St W,43.667158,-79.402761,1
4,7004,University Ave / Elm St,43.656518,-79.389099,1

**Historical Weather**

In [6]:
weather.head()

,location_id,forecast_date,maxtempc,humidity,total_precip,avg_cloudcover,avg_windspeed
0,1,2019-01-01,1,77.250,3.6,50.625,16.875
1,1,2019-01-02,-5,69.000,0.2,41.750,8.625
2,1,2019-01-03,-1,68.500,1.3,68.250,17.750
3,1,2019-01-04,2,77.250,0.0,7.625,18.125
4,1,2019-01-05,3,81.125,0.0,23.750,11.250

**Bikes**

In [7]:
tor_bikes.head()

   bike_id  location_id
0     1296            1
1     2947            1
2     2293            1
3      283            1
4     1799            1

In [8]:
van_bikes.head()

   bike_id  location_id
0    388.0            2
1   1880.0            2
2    779.0            2
3   2123.0            2
4    444.0            2

In [9]:
bos_bikes.head()

   bike_id  location_id
0     3689            3
1     4142            3
2     1628            3
3     2969            3
4     3469            3

In [10]:
nyc_bikes.head()

   bike_id  location_id
0    15839            4
1    32723            4
2    27451            4
3    21579            4
4    35379            4

**Member Types**

In [11]:
tor_users.head()

     member_type  location_id
0  Annual Member            1
1  Casual Member            1

In [12]:
van_users.head()

                 member_type  location_id
0               365 Standard            2
1                   365 Plus            2
2     Vancity Community Pass            2
3     365 Day Pass Plus SALE            2
4  365 Day Founding Standard            2

In [13]:
bos_users.head()

  member_type  location_id
0  Subscriber            3
1    Customer            3

In [14]:
nyc_users.head()

  member_type  location_id
0  Subscriber            4
1    Customer            4

**Pricing Index**

In [15]:
pricing_index.head()

   location_id    member_type                 plan  amount
0            1  Annual Member    Annual Membership   99.00
1            1  Casual Member  72 HOUR ACCESS PASS   15.00
2            1  Casual Member  24 HOUR ACCESS PASS    7.00
3            1  Casual Member      Single Trip For    3.25
4            2        24 Hour         24 Hour Pass   12.00

**Ridership**

In [16]:
# Toronto
toronto.head()

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
0,1547,01/01/2019 00:08,01/01/2019 00:33,7021,7233,1296,Annual Member,1
1,1112,01/01/2019 00:10,01/01/2019 00:29,7160,7051,2947,Annual Member,1
2,589,01/01/2019 00:15,01/01/2019 00:25,7055,7013,2293,Annual Member,1
3,259,01/01/2019 00:16,01/01/2019 00:20,7012,7235,283,Annual Member,1
4,281,01/01/2019 00:19,01/01/2019 00:24,7041,7257,1799,Annual Member,1

In [17]:
# Vancouver
vancouver.head()

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
0,177,2/1/2019 0:00,2/1/2019 0:00,198,298,388.0,365 Standard,2
1,221,2/1/2019 0:00,2/1/2019 0:00,193,173,1880.0,365 Plus,2
2,3272,2/1/2019 0:00,2/1/2019 0:00,63,143,779.0,Vancity Community Pass,2
3,157,2/1/2019 0:00,2/1/2019 0:00,64,78,2123.0,365 Day Pass Plus SALE,2
4,516,1/31/2019 23:00,2/1/2019 0:00,60,196,444.0,365 Day Pass Plus SALE,2

In [18]:
# Boston
boston.head()

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
0,371,2019-01-01 00:09:13.7980,2019-01-01 00:15:25.3360,80,179,3689,Subscriber,3
1,264,2019-01-01 00:33:56.1820,2019-01-01 00:38:20.8800,117,189,4142,Subscriber,3
2,458,2019-01-01 00:41:54.6000,2019-01-01 00:49:33.2730,68,96,1628,Subscriber,3
3,364,2019-01-01 00:43:32.5710,2019-01-01 00:49:37.4260,89,334,2969,Subscriber,3
4,681,2019-01-01 00:49:56.4640,2019-01-01 01:01:17.7010,73,367,3469,Subscriber,3

In [19]:
# New York
newyork.head()

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
0,320,2019-01-01 00:01:47.4010,2019-01-01 00:07:07.5810,3160.0,3283.0,15839,Subscriber,4
1,316,2019-01-01 00:04:43.7360,2019-01-01 00:10:00.6080,519.0,518.0,32723,Subscriber,4
2,591,2019-01-01 00:06:03.9970,2019-01-01 00:15:55.4380,3171.0,3154.0,27451,Subscriber,4
3,2719,2019-01-01 00:07:03.5450,2019-01-01 00:52:22.6500,504.0,3709.0,21579,Subscriber,4
4,303,2019-01-01 00:07:35.9450,2019-01-01 00:12:39.5020,229.0,503.0,35379,Subscriber,4

### Load data

#### Connect to database

In [20]:
# connect to database
cnx = f'postgresql://{conn_string}'
engine = create_engine(cnx)

In [21]:
# confirm tables
engine.table_names()

['locations',
 'historicalweather',
 'membertypes',
 'pricing',
 'stations',
 'bikes',
 'ridership']

***Locations***

In [22]:
# load locations into database
df.to_sql(name='locations', con=engine, if_exists='append', index=True)

***Stations***

In [23]:
# load stations into database
stns.to_sql(name='stations', con=engine, if_exists='append', index=False)

***Historical Weather***

In [24]:
# load historical weather into database
weather.to_sql(name='historicalweather', con=engine, if_exists='append', index=False)

***Bikes***

In [25]:
# load toronto bikes into database
tor_bikes.to_sql(name='bikes', con=engine, if_exists='append', index=False)

In [26]:
# load vancouver bikes into database
van_bikes.to_sql(name='bikes', con=engine, if_exists='append', index=False)

In [27]:
# load boston bikes into database
bos_bikes.to_sql(name='bikes', con=engine, if_exists='append', index=False)

In [28]:
# load new york bikes into database
nyc_bikes.to_sql(name='bikes', con=engine, if_exists='append', index=False)

***Member Types***

In [29]:
# load toronto member types
tor_users.to_sql(name='membertypes', con=engine, if_exists='append', index=False)

In [30]:
# load vancouver member types
van_users.to_sql(name='membertypes', con=engine, if_exists='append', index=False)

In [31]:
# load boston member types
bos_users.to_sql(name='membertypes', con=engine, if_exists='append', index=False)

In [32]:
# load new york member types
nyc_users.to_sql(name='membertypes', con=engine, if_exists='append', index=False)

***Pricing Index***

In [33]:
# load pricing index
pricing_index.to_sql(name='pricing', con=engine, if_exists='append',index=False, index_label='price_id')

### Load Ridership

#### check reference to stations table

In [34]:
# create session
session = Session(bind=engine)
# declare a base using automap_base
Base = automap_base()
# use the Base class to reflect the database tables
Base.prepare(engine, reflect=True)
Base.classes.keys()
Stations = Base.classes.stations

In [35]:
Base.classes.keys()

['locations',
 'historicalweather',
 'membertypes',
 'pricing',
 'stations',
 'bikes',
 'ridership']

***Verify that all station_ids used in bikeshare exists in Stations table***

In [36]:
# get all stations
all_stations = session.query(Stations.station_id).all()
all_stns_df = pd.DataFrame(all_stations)
all_stns_df

      station_id
0           7000
1           7001
2           7002
3           7003
4           7004
...          ...
2398        4248
2399        4249
2400        4250
2401        4252
2402        4253

[2403 rows x 1 columns]

### ***Toronto***

In [37]:
# check for Toronto records with start_station_id not in stations table
missing_start = toronto[-toronto["start_station_id"].isin(all_stns_df["station_id"])]
missing_start = missing_start.rename(columns={"start_station_id":"station_id"})

In [38]:
missing_start

Empty DataFrame
Columns: [trip_duration, start_date, end_date, station_id, end_station_id, bike_id, member_type, location_id]
Index: []

In [39]:
# check for Toronto records with end_station_id not in stations table
missing_end = toronto[-toronto["end_station_id"].isin(all_stns_df["station_id"])]
missing_end = missing_end.rename(columns={"start_station_id":"station_id"})

In [40]:
missing_end

Empty DataFrame
Columns: [trip_duration, start_date, end_date, station_id, end_station_id, bike_id, member_type, location_id]
Index: []

*Load rows with station_id existing in stations table*

In [41]:
toronto = toronto[toronto["start_station_id"].isin(all_stns_df["station_id"])]
toronto = toronto[toronto["end_station_id"].isin(all_stns_df["station_id"])]

In [42]:
toronto

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
0,1547,01/01/2019 00:08,01/01/2019 00:33,7021,7233,1296,Annual Member,1
1,1112,01/01/2019 00:10,01/01/2019 00:29,7160,7051,2947,Annual Member,1
2,589,01/01/2019 00:15,01/01/2019 00:25,7055,7013,2293,Annual Member,1
3,259,01/01/2019 00:16,01/01/2019 00:20,7012,7235,283,Annual Member,1
4,281,01/01/2019 00:19,01/01/2019 00:24,7041,7257,1799,Annual Member,1
...,...,...,...,...,...,...,...,...
99995,465,02/27/2019 07:03,02/27/2019 07:11,7320,7323,3729,Annual Member,1
99996,360,02/27/2019 07:04,02/27/2019 07:10,7143,7252,3641,Annual Member,1
99997,447,02/27/2019 07:05,02/27/2019 07:12,7054,7033,1091,Annual Member,1
99998,407,02/27/2019 07:05,02/27/2019 07:12,7031,7129,1028,Annual Member,1
99999,1097,02/27/2019 07:07,02/27/2019 07:26,7211,7047,120,Annual Member,1

In [43]:
# get all Toronto stations
stns_toronto = session.query(Stations.station_id).filter(Stations.location_id==1).all()
stns_toronto = pd.DataFrame(stns_toronto)
stns_toronto = stns_toronto.rename(columns={"station_id": "start_station_id"})
stns_toronto

     start_station_id
0                7000
1                7001
2                7002
3                7003
4                7004
..                ...
602              7660
603              7662
604              7663
605              7664
606              7665

[607 rows x 1 columns]

In [44]:
# remove Toronto records with start_station_id not in stations table
tor_df = pd.merge(toronto, stns_toronto, how='inner', on='start_station_id')

In [45]:
tor_df

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
0,1547,01/01/2019 00:08,01/01/2019 00:33,7021,7233,1296,Annual Member,1
1,453,01/01/2019 10:35,01/01/2019 10:42,7021,7253,1118,Annual Member,1
2,632,01/01/2019 14:13,01/01/2019 14:24,7021,7323,111,Annual Member,1
3,234,01/01/2019 19:05,01/01/2019 19:09,7021,7052,942,Annual Member,1
4,843,01/02/2019 09:14,01/02/2019 09:28,7021,7036,1814,Annual Member,1
...,...,...,...,...,...,...,...,...
99995,1255,02/02/2019 14:24,02/02/2019 14:45,7345,7076,3156,Casual Member,1
99996,1240,02/02/2019 14:24,02/02/2019 14:45,7345,7076,1233,Casual Member,1
99997,1226,02/03/2019 15:23,02/03/2019 15:43,7345,7108,2974,Annual Member,1
99998,1515,02/04/2019 16:06,02/04/2019 16:31,7345,7313,851,Annual Member,1
99999,931,02/22/2019 14:33,02/22/2019 14:48,7345,7099,3731,Casual Member,1

In [46]:
# rename Toronto station column to check if end_station_id exists in stations table
stns_toronto = stns_toronto.rename(columns={"start_station_id": "end_station_id"})
stns_toronto

     end_station_id
0              7000
1              7001
2              7002
3              7003
4              7004
..              ...
602            7660
603            7662
604            7663
605            7664
606            7665

[607 rows x 1 columns]

In [47]:
#remove Toronto records with end_station_id not in stations table
toronto = pd.merge(tor_df, stns_toronto, how='inner', on='end_station_id')

In [48]:
# count number of records for insert to ridership table
toronto.count()

trip_duration       100000
start_date          100000
end_date            100000
start_station_id    100000
end_station_id      100000
bike_id             100000
member_type         100000
location_id         100000
dtype: int64

In [ ]:
# Load Toronto bikeshare data to ridership table
toronto.to_sql(name='ridership', con=engine, if_exists='append', index=False, index_label='id')

### ***Vancouver***

In [ ]:
# check for Vancouver records with start_station_id missing in stations table
missing_start = vancouver[-vancouver["start_station_id"].isin(all_stns_df["station_id"])]
missing_start = missing_start.rename(columns={"start_station_id":"station_id"})

In [ ]:
missing_start

In [ ]:
# check for Vancouver records with end_station_id missing in stations table
missing_end = vancouver[-vancouver["end_station_id"].isin(all_stns_df["station_id"])]
missing_end = missing_end.rename(columns={"start_station_id":"station_id"})

In [ ]:
missing_end

In [ ]:
# check Vancouver records with start_station_id and end_station_id existing in stations table
vancouver = vancouver[vancouver["start_station_id"].isin(all_stns_df["station_id"])]
vancouver = vancouver[vancouver["end_station_id"].isin(all_stns_df["station_id"])]

In [ ]:
vancouver

In [ ]:
# get all Vancouver stations
stns_vancouver = session.query(Stations.station_id).filter(Stations.location_id==2).all()
stns_vancouver = pd.DataFrame(stns_vancouver)
stns_vancouver = stns_vancouver.rename(columns={"station_id": "start_station_id"})
stns_vancouver

In [ ]:
# remove Vancouver records with start_station_id not in stations table
vancouver_df = pd.merge(vancouver, stns_vancouver, how='inner', on='start_station_id')

In [ ]:
# rename Vancouver station column to end_station_id
stns_vancouver = stns_vancouver.rename(columns={"start_station_id": "end_station_id"})
stns_vancouver.head()

In [ ]:
#remove Vancouver records with end_station_id not in stations table
vancouver = pd.merge(vancouver_df, stns_vancouver, how='inner', on='end_station_id')

In [ ]:
# check number of records for insert to database
vancouver.count()

In [ ]:
# Load Vancouver bikeshare data to ridership table
vancouver.to_sql(name='ridership', con=engine, if_exists='append', index=False, index_label='id')

### ***Boston***

In [ ]:
# check Boston data for missing start_station_id
missing_start = boston[-boston["start_station_id"].isin(all_stns_df["station_id"])]
missing_start

In [ ]:
# check for missing end_station_id
missing_end = boston[-boston["end_station_id"].isin(all_stns_df["station_id"])]
missing_end

In [ ]:
boston = boston[boston["start_station_id"].isin(all_stns_df["station_id"])]
boston = boston[boston["end_station_id"].isin(all_stns_df["station_id"])]
boston

In [ ]:
# get all Boston stations
stns_boston = session.query(Stations.station_id).filter(Stations.location_id==3).all()
stns_boston = pd.DataFrame(stns_boston)
stns_boston = stns_boston.rename(columns={"station_id": "start_station_id"})
stns_boston

In [ ]:
# remove Boston records with start_station_id not in stations table
df = pd.merge(boston, stns_boston, how='inner', on='start_station_id')

In [ ]:
# rename Boston station column to end_station_id
stns_boston = stns_boston.rename(columns={"start_station_id": "end_station_id"})
stns_boston.head()

In [ ]:
#remove Boston records with end_station_id not in stations table
boston_df = pd.merge(df, stns_boston, how='inner', on='end_station_id')

In [ ]:
# count number of Boston records for insert to ridership table
boston_df.count()

In [ ]:
# load Boston records to ridership table
boston_df.to_sql(name='ridership', con=engine, if_exists='append', index=False, index_label='id')

### ***New York***

In [ ]:
# check for New York records with missing start_station_id in stations table
missing_start = newyork[-newyork["start_station_id"].isin(all_stns_df["station_id"])]
missing_start

In [ ]:
# check for New York records with missing end_station_id in stations table
missing_end = newyork[-newyork["end_station_id"].isin(all_stns_df["station_id"])]
missing_end

In [ ]:
# check New York records with start_station_id and end_station_id both in stations table
newyork = newyork[newyork["start_station_id"].isin(all_stns_df["station_id"])]
newyork = newyork[newyork["end_station_id"].isin(all_stns_df["station_id"])]
newyork

In [ ]:
# get New York stations data
stns_newyork = session.query(Stations.station_id).filter(Stations.location_id==4).all()
stns_newyork = pd.DataFrame(stns_newyork)
stns_newyork = stns_newyork.rename(columns={"station_id": "start_station_id"})
stns_newyork

In [ ]:
# remove New York records with start_station_id not existing in stations table
ny_df = pd.merge(newyork, stns_newyork, how='inner', on='start_station_id')

In [ ]:
# rename New Yorks stations column to end_station_id
stns_newyork = stns_newyork.rename(columns={"start_station_id": "end_station_id"})
stns_newyork.head()

In [ ]:
# remove New York records with end_station_id not existing in stations table
newyork_df = pd.merge(ny_df, stns_newyork, how='inner', on='end_station_id')

In [ ]:
# count number of New York records for insert to ridership table
newyork_df.count()

In [ ]:
newyork_df.to_sql(name='ridership', con=engine, if_exists='append', index=False, index_label='id')

**Close session**

In [ ]:
session.close()